// 허슬러 : 0
// 힙스터 : 1
// 해커: 2

// 3가지 결과

const qnaList = [
    {
        q: "앱이나 게임 같은 새로운 서비스를 만들 때 가장 고려할 것은 무엇인가요?",
        a: [
            {
                answer: "a. 직관적이고 예쁜 디자인인가?",
                type: [1],
            },
            {
                answer: "b. 돈을 벌 수 있는 서비스인가?",
                type: [0],
            },
            {
                answer: "c. 버그가 없고 업데이트 하기에 쉬운가?",
                type: [2],
            },
            {
                answer: "d. 사람들이 좋아하는 서비스일까?",
                type: [0],
            },
        ],
    },
    {
        q: "앱이나 게임 같은 새로운 서비스를 만들 때 가장 고려할 것은 무엇인가요?",
        a: [
            {
                answer: "a. 직관적이고 예쁜 디자인인가?",
                type: [1],
            },
            {
                answer: "b. 돈을 벌 수 있는 서비스인가?",
                type: [0],
            },
            {
                answer: "c. 버그가 없고 업데이트 하기에 쉬운가?",
                type: [2],
            },
            {
                answer: "d. 사람들이 좋아하는 서비스일까?",
                type: [0],
            },
        ],
    },
    {
        q: "앱이나 게임 같은 새로운 서비스를 만들 때 가장 고려할 것은 무엇인가요?",
        a: [
            {
                answer: "a. 직관적이고 예쁜 디자인인가?",
                type: [1],
            },
            {
                answer: "b. 돈을 벌 수 있는 서비스인가?",
                type: [0],
            },
            {
                answer: "c. 버그가 없고 업데이트 하기에 쉬운가?",
                type: [2],
            },
            {
                answer: "d. 사람들이 좋아하는 서비스일까?",
                type: [0],
            },
        ],
    },
    {
        q: "앱이나 게임 같은 새로운 서비스를 만들 때 가장 고려할 것은 무엇인가요?",
        a: [
            {
                answer: "a. 직관적이고 예쁜 디자인인가?",
                type: [1],
            },
            {
                answer: "b. 돈을 벌 수 있는 서비스인가?",
                type: [0],
            },
            {
                answer: "c. 버그가 없고 업데이트 하기에 쉬운가?",
                type: [2],
            },
            {
                answer: "d. 사람들이 좋아하는 서비스일까?",
                type: [0],
            },
        ],
    },
    {
        q: "앱이나 게임 같은 새로운 서비스를 만들 때 가장 고려할 것은 무엇인가요?",
        a: [
            {
                answer: "a. 직관적이고 예쁜 디자인인가?",
                type: [1],
            },
            {
                answer: "b. 돈을 벌 수 있는 서비스인가?",
                type: [0],
            },
            {
                answer: "c. 버그가 없고 업데이트 하기에 쉬운가?",
                type: [2],
            },
            {
                answer: "d. 사람들이 좋아하는 서비스일까?",
                type: [0],
            },
        ],
    },
    {
        q: "앱이나 게임 같은 새로운 서비스를 만들 때 가장 고려할 것은 무엇인가요?",
        a: [
            {
                answer: "a. 직관적이고 예쁜 디자인인가?",
                type: [1],
            },
            {
                answer: "b. 돈을 벌 수 있는 서비스인가?",
                type: [0],
            },
            {
                answer: "c. 버그가 없고 업데이트 하기에 쉬운가?",
                type: [2],
            },
            {
                answer: "d. 사람들이 좋아하는 서비스일까?",
                type: [0],
            },
        ],
    },
    {
        q: "앱이나 게임 같은 새로운 서비스를 만들 때 가장 고려할 것은 무엇인가요?",
        a: [
            {
                answer: "a. 직관적이고 예쁜 디자인인가?",
                type: [1],
            },
            {
                answer: "b. 돈을 벌 수 있는 서비스인가?",
                type: [0],
            },
            {
                answer: "c. 버그가 없고 업데이트 하기에 쉬운가?",
                type: [2],
            },
            {
                answer: "d. 사람들이 좋아하는 서비스일까?",
                type: [0],
            },
        ],
    },
    {
        q: "앱이나 게임 같은 새로운 서비스를 만들 때 가장 고려할 것은 무엇인가요?",
        a: [
            {
                answer: "a. 직관적이고 예쁜 디자인인가?",
                type: [1],
            },
            {
                answer: "b. 돈을 벌 수 있는 서비스인가?",
                type: [0],
            },
            {
                answer: "c. 버그가 없고 업데이트 하기에 쉬운가?",
                type: [2],
            },
            {
                answer: "d. 사람들이 좋아하는 서비스일까?",
                type: [0],
            },
        ],
    },
    {
        q: "앱이나 게임 같은 새로운 서비스를 만들 때 가장 고려할 것은 무엇인가요?",
        a: [
            {
                answer: "a. 직관적이고 예쁜 디자인인가?",
                type: [1],
            },
            {
                answer: "b. 돈을 벌 수 있는 서비스인가?",
                type: [0],
            },
            {
                answer: "c. 버그가 없고 업데이트 하기에 쉬운가?",
                type: [2],
            },
            {
                answer: "d. 사람들이 좋아하는 서비스일까?",
                type: [0],
            },
        ],
    },
    {
        q: "앱이나 게임 같은 새로운 서비스를 만들 때 가장 고려할 것은 무엇인가요?",
        a: [
            {
                answer: "a. 직관적이고 예쁜 디자인인가?",
                type: [1],
            },
            {
                answer: "b. 돈을 벌 수 있는 서비스인가?",
                type: [0],
            },
            {
                answer: "c. 버그가 없고 업데이트 하기에 쉬운가?",
                type: [2],
            },
            {
                answer: "d. 사람들이 좋아하는 서비스일까?",
                type: [0],
            },
        ],
    },
    {
        q: "앱이나 게임 같은 새로운 서비스를 만들 때 가장 고려할 것은 무엇인가요?",
        a: [
            {
                answer: "a. 직관적이고 예쁜 디자인인가?",
                type: [1],
            },
            {
                answer: "b. 돈을 벌 수 있는 서비스인가?",
                type: [0],
            },
            {
                answer: "c. 버그가 없고 업데이트 하기에 쉬운가?",
                type: [2],
            },
            {
                answer: "d. 사람들이 좋아하는 서비스일까?",
                type: [0],
            },
        ],
    },
    {
        q: "앱이나 게임 같은 새로운 서비스를 만들 때 가장 고려할 것은 무엇인가요?",
        a: [
            {
                answer: "a. 직관적이고 예쁜 디자인인가?",
                type: [1],
            },
            {
                answer: "b. 돈을 벌 수 있는 서비스인가?",
                type: [0],
            },
            {
                answer: "c. 버그가 없고 업데이트 하기에 쉬운가?",
                type: [2],
            },
            {
                answer: "d. 사람들이 좋아하는 서비스일까?",
                type: [0],
            },
        ],
    },
    {
        q: "앱이나 게임 같은 새로운 서비스를 만들 때 가장 고려할 것은 무엇인가요?",
        a: [
            {
                answer: "a. 직관적이고 예쁜 디자인인가?",
                type: [1],
            },
            {
                answer: "b. 돈을 벌 수 있는 서비스인가?",
                type: [0],
            },
            {
                answer: "c. 버그가 없고 업데이트 하기에 쉬운가?",
                type: [2],
            },
            {
                answer: "d. 사람들이 좋아하는 서비스일까?",
                type: [0],
            },
        ],
    },
    {
        q: "앱이나 게임 같은 새로운 서비스를 만들 때 가장 고려할 것은 무엇인가요?",
        a: [
            {
                answer: "a. 직관적이고 예쁜 디자인인가?",
                type: [1],
            },
            {
                answer: "b. 돈을 벌 수 있는 서비스인가?",
                type: [0],
            },
            {
                answer: "c. 버그가 없고 업데이트 하기에 쉬운가?",
                type: [2],
            },
            {
                answer: "d. 사람들이 좋아하는 서비스일까?",
                type: [0],
            },
        ],
    },
    {
        q: "앱이나 게임 같은 새로운 서비스를 만들 때 가장 고려할 것은 무엇인가요?",
        a: [
            {
                answer: "a. 직관적이고 예쁜 디자인인가?",
                type: [1],
            },
            {
                answer: "b. 돈을 벌 수 있는 서비스인가?",
                type: [0],
            },
            {
                answer: "c. 버그가 없고 업데이트 하기에 쉬운가?",
                type: [2],
            },
            {
                answer: "d. 사람들이 좋아하는 서비스일까?",
                type: [0],
            },
        ],
    },
    {
        q: "앱이나 게임 같은 새로운 서비스를 만들 때 가장 고려할 것은 무엇인가요?",
        a: [
            {
                answer: "a. 직관적이고 예쁜 디자인인가?",
                type: [1],
            },
            {
                answer: "b. 돈을 벌 수 있는 서비스인가?",
                type: [0],
            },
            {
                answer: "c. 버그가 없고 업데이트 하기에 쉬운가?",
                type: [2],
            },
            {
                answer: "d. 사람들이 좋아하는 서비스일까?",
                type: [0],
            },
        ],
    },
    {
        q: "앱이나 게임 같은 새로운 서비스를 만들 때 가장 고려할 것은 무엇인가요?",
        a: [
            {
                answer: "a. 직관적이고 예쁜 디자인인가?",
                type: [1],
            },
            {
                answer: "b. 돈을 벌 수 있는 서비스인가?",
                type: [0],
            },
            {
                answer: "c. 버그가 없고 업데이트 하기에 쉬운가?",
                type: [2],
            },
            {
                answer: "d. 사람들이 좋아하는 서비스일까?",
                type: [0],
            },
        ],
    },
    {
        q: "앱이나 게임 같은 새로운 서비스를 만들 때 가장 고려할 것은 무엇인가요?",
        a: [
            {
                answer: "a. 직관적이고 예쁜 디자인인가?",
                type: [1],
            },
            {
                answer: "b. 돈을 벌 수 있는 서비스인가?",
                type: [0],
            },
            {
                answer: "c. 버그가 없고 업데이트 하기에 쉬운가?",
                type: [2],
            },
            {
                answer: "d. 사람들이 좋아하는 서비스일까?",
                type: [0],
            },
        ],
    },
    {
        q: "앱이나 게임 같은 새로운 서비스를 만들 때 가장 고려할 것은 무엇인가요?",
        a: [
            {
                answer: "a. 직관적이고 예쁜 디자인인가?",
                type: [1],
            },
            {
                answer: "b. 돈을 벌 수 있는 서비스인가?",
                type: [0],
            },
            {
                answer: "c. 버그가 없고 업데이트 하기에 쉬운가?",
                type: [2],
            },
            {
                answer: "d. 사람들이 좋아하는 서비스일까?",
                type: [0],
            },
        ],
    },
    {
        q: "앱이나 게임 같은 새로운 서비스를 만들 때 가장 고려할 것은 무엇인가요?",
        a: [
            {
                answer: "a. 직관적이고 예쁜 디자인인가?",
                type: [1],
            },
            {
                answer: "b. 돈을 벌 수 있는 서비스인가?",
                type: [0],
            },
            {
                answer: "c. 버그가 없고 업데이트 하기에 쉬운가?",
                type: [2],
            },
            {
                answer: "d. 사람들이 좋아하는 서비스일까?",
                type: [0],
            },
        ],
    },
];

const infoList = [
    {
        nameIntro: "뒤에서 묵묵히 모든걸 해낼께!",
        name: "<백엔드형>",
        descTitle1: "🦁 당신은 어떤 상황에서든 최대 효율을 뽑아내는 전략가!",
        desc1: "반복적인 일은 질색인 당신! 효율과 정답을 찾아 헤매는 당신은 찐 개발자의 머리를 타고 났습니다!",
        descTitle2:
            "🦁 당신은 폭넓은 이해력과 뛰어난 설계능력을 가지고 있어요.",
        desc2: "백엔드 개발자들은 눈에 보이지 않는 것들을 개발합니다. 그렇기에 추상적인 것들을 잘 받아들이는 능력이 필요하죠. 실체 없는 것을 구상하고 이해하는 탁월한 능력을 가진 당신은 백엔드 개발자로서 서비스와 데이터 저장에 대한 구조를 이해하는 탁월한 능력을 가졌답니다.",
    },
    {
        nameIntro: "보이는 부분은 내가책임질께!",
        name: "<프론트엔드형>",
        descTitle1:
            "🦁 당신은 새로운 것에 대한 호기심과 도전의식으로 가득해요.",
        desc1: "도전적이고 창의적이며 트렌드에 민감하기 때문에 빠르게 변화하는 웹 기술을 효율적으로 다룰 수 있어요.",
        descTitle2: "🦁 당신은 섬세한 관찰력을 가지고 있어요.",
        desc2: "사용자의 입장에서, 디테일한 부분까지 놓치지 않고 구현할 수 있는 능력을 가지고 있으므로 사용자에게 적합한 UI를 제공할 수 있어요.",
    },
    {
        nameIntro: "보이는 부분은 내가 책임질께!",
        name: "<디자인형>",
        descTitle1: "🦁 당신은 예술적인 감각을 타고났어요.",
        desc1: "아름다움을 표현할 수 있는 디자인감각 및 색채감각이 타고난 당신은 새롭고도 트렌디한 디자인들을 막힘없이 창의적으로 생각해냅니다.",
        descTitle2:
            "🦁 당신은 상대방이 원하는 니즈를 파악하는 뛰어난 통찰력과 관찰력을 가지고 있어요.",
        desc2: "디자이너의 가장 큰 역할은 사용자가 편리한 디자인을 하는 것이기 때문에 누군가의 니즈를 말하지 않아도 캐치해내는 능력을 가진 당신은 사용자에게 가장 적합한 디자인을 제공할 수 있어요.",
    },
];
